#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПриЗаписи(Отказ)
	

    // 1. Ничего не делаем во время обмена данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    // 2. Если цена не заполнена – историю не пишем
	Если Не ЗначениеЗаполнено(ЦенаЗаСутки) Тогда
		Возврат;
	КонецЕсли;

    // 3. Создаём набор записей регистра сведений ЦеныАренды
	Набор = РегистрыСведений.ЦеныАренды.СоздатьНаборЗаписей();

    // 4. Добавляем новую строку истории
	Запись = Набор.Добавить();
	Запись.Период = ТекущаяДатаСеанса(); // дата начала действия новой цены
	Запись.ОбъектАренды = Ссылка; // этот объект аренды
	Запись.ЦенаЗаСутки  = ЦенаЗаСутки;

    // 5. Сохраняем набор
	Набор.Записать();

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли