#Область ОбработчикиСобытий

// Обработчик команды печати.
//
// Параметры:
//   ПараметрКоманды - ДокументСсылка.Бронирование
//   ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

    ТабДок = Новый ТабличныйДокумент;

    // вызов серверной процедуры (ниже в этом же модуле)
    ДоговорАренды(ТабДок, ПараметрКоманды);

    ТабДок.ОтображатьСетку     = Ложь;
    ТабДок.ОтображатьЗаголовки = Ложь;
    ТабДок.ТолькоПросмотр      = Ложь;

    ТабДок.Показать();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДоговорАренды(ТабДок, ПараметрКоманды)

    // просто прокидываем вызов в модуль менеджера документа
    Документы.Бронирование.ДоговорАренды(ТабДок, ПараметрКоманды);

КонецПроцедуры

#КонецОбласти
