//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область СлужебныеПроцедурыИФункции

//Процедура ОбновитьЦенуЗаСутки() Экспорт

    // Здесь мы на объекте документа, реквизиты доступны напрямую
//    Если НЕ ОбъектАренды.Пустая() Тогда
//        ЦенаЗаСутки = ОбъектАренды.ЦенаЗаСутки;
//    Иначе
//        ЦенаЗаСутки = 0;
//    КонецЕсли;

//КонецПроцедуры

//#КонецОбласти

//#Иначе
//	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
//#КонецЕсли