//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область СлужебныеПроцедурыИФункции

//Процедура ОбновитьЦенуЗаСутки() Экспорт

    // Здесь мы на объекте документа, реквизиты доступны напрямую
//    Если НЕ ОбъектАренды.Пустая() Тогда
//        ЦенаЗаСутки = ОбъектАренды.ЦенаЗаСутки;
//    Иначе
//        ЦенаЗаСутки = 0;
//    КонецЕсли;

//КонецПроцедуры

//#КонецОбласти

//#Иначе
//	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
//#КонецЕсли

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область  СлужебныеПроцедурыИФункции
Процедура ПриЗаполнении()

    // Если ответственный ещё не выбран – берем сотрудника из параметра сеанса
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;

КонецПроцедуры
#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
