#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПродажиУслуг
	Движения.ПродажиУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаУслугиИТовары из УслугиИТовары Цикл
		Движение = Движения.ПродажиУслуг.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Номенклатура = ТекСтрокаУслугиИТовары.Номенклатура;
		Движение.Количество = ТекСтрокаУслугиИТовары.Количество;
		Движение.Сумма = ТекСтрокаУслугиИТовары.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли